EDT/УТ/src/Catalogs/новаТранспорт/новаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаТранспорт</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнешняяМаршрутизация</name>
      <description>Внешняя маршрутизация</description>
    </items>
  </predefined>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.новаВидыТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.новаМаркиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосударственнойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <comment>В тоннах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаКузова</name>
    <comment>В метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКузова</name>
    <comment>В кубических метрах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГаражныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяВысотаКузова</name>
    <comment>В метрах (используется для ограничений прохождения по улицам)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.новаСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхРайонов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вместимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВодитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойГараж</name>
    <type>
      <types>CatalogRef.новаГаражи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.новаТипыКузовов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗагрузки</name>
    <type>
      <types>CatalogRef.новаСпособыЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропуск</name>
    <type>
      <types>CatalogRef.новаТипыПропусков</types>
    </type>
  </attributes>
  <attributes>
    <name>Лифт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Манипулятор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СанитарныйПаспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонСтоянки</name>
    <type>
      <types>CatalogRef.новаГеоРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБак</name>
    <type>
      <types>CatalogRef.новаБакиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныеНормы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииТранспортаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаёмныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезМобильногоПриложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <type>
      <types>CatalogRef.ТипыТранспортаДляЛогистики</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаКилометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяСкорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Районы</name>
    <attributes>
      <name>Район</name>
      <type>
        <types>CatalogRef.новаГеоРайоны</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыТранспорта/ДополнительныеПараметрыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыТранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>УдаленноеЗакрытиеРейсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимПечатиЧеков</name>
    <type>
      <types>EnumRef.ВариантыПечатиЧековРМЭкипажа</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяРольТранспорта</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </resources>
  <resources>
    <name>КассовыйСервер</name>
    <type>
      <types>ExchangePlanRef.ОбменСКассовымСервером</types>
    </type>
  </resources>
  <resources>
    <name>ФорматАвтотранспорта</name>
    <type>
      <types>CatalogRef.ФорматыАвтотранспорта</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоШтатныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/новаТранспорт/Forms/ФормаГруппы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДополнительныеПараметрыТранспортаСрезПоследних.КассовыйСервер КАК КассовыйСервер
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних(, Транспорт = &ГруппаТранспорта) КАК ДополнительныеПараметрыТранспортаСрезПоследних";
		Запрос.УстановитьПараметр("ГруппаТранспорта", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			КассовыйСервер = Выборка.КассовыйСервер;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если КассовыйСерверИзменен Тогда 
		Транспорт = Объект.Ссылка;
		НаборЗаписей = РегистрыСведений.ДополнительныеПараметрыТранспорта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Транспорт.Установить(Транспорт);
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДата();
		Запись.Транспорт = Транспорт; 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДополнительныеПараметрыТранспортаСрезПоследних.УдаленноеЗакрытиеРейсов КАК УдаленноеЗакрытиеРейсов,
		|	ДополнительныеПараметрыТранспортаСрезПоследних.РежимПечатиЧеков КАК РежимПечатиЧеков,
		|	ДополнительныеПараметрыТранспортаСрезПоследних.МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации КАК МаксимальноеКоличествоЗаказовПриПолигональнойМаршрутизации,
		|	ДополнительныеПараметрыТранспортаСрезПоследних.ОсновнаяРольТранспорта КАК ОсновнаяРольТранспорта,
		|	ДополнительныеПараметрыТранспортаСрезПоследних.КассовыйСервер КАК КассовыйСервер
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыТранспорта.СрезПоследних(, Транспорт = &ГруппаТранспорта) КАК ДополнительныеПараметрыТранспортаСрезПоследних";
		Запрос.УстановитьПараметр("ГруппаТранспорта", Транспорт);	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Если Выборка.КассовыйСервер <> КассовыйСервер Тогда 
				ЗаполнитьЗначенияСвойств(Запись,Выборка,,"КассовыйСервер");	
				Запись.КассовыйСервер = КассовыйСервер;
			Иначе
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		НаборЗаписей.Записать(Ложь);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КассовыйСерверПриИзменении(Элемент)
	КассовыйСерверИзменен = Истина;
КонецПроцедуры
